<p style="text-align:center">
    <a href="https://skills.network" target="_blank">
    <img src="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/assets/logos/SN_web_lightmode.png" width="200" alt="Skills Network Logo">
    </a>
</p>

<h1 align=center><font size = 5>Assignment: SQL Notebook for Peer Assignment</font></h1>

Estimated time needed: **60** minutes.

## Introduction
Using this Python notebook you will:

1.  Understand the Spacex DataSet
2.  Load the dataset  into the corresponding table in a Db2 database
3.  Execute SQL queries to answer assignment questions

## Overview of the DataSet

SpaceX has gained worldwide attention for a series of historic milestones. 

It is the only private company ever to return a spacecraft from low-earth orbit, which it first accomplished in December 2010.
SpaceX advertises Falcon 9 rocket launches on its website with a cost of 62 million dollars wheras other providers cost upward of 165 million dollars each, much of the savings is because Space X can reuse the first stage. 


Therefore if we can determine if the first stage will land, we can determine the cost of a launch. 

This information can be used if an alternate company wants to bid against SpaceX for a rocket launch.

This dataset includes a record for each payload carried during a SpaceX mission into outer space.

### Download the datasets

This assignment requires you to load the spacex dataset.

In many cases the dataset to be analyzed is available as a .CSV (comma separated values) file, perhaps on the internet. Click on the link below to download and save the dataset (.CSV file):

 <a href="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBM-DS0321EN-SkillsNetwork/labs/module_2/data/Spacex.csv" target="_blank">Spacex DataSet</a>

### Connect to the database

Let us first load the SQL extension and establish a connection with the database

# ACHTUNG: I'm removing the information for connectiong with my personal SQL server.

**Note:This below code is added to remove blank rows from table**

## Tasks

Now write and execute SQL queries to solve the assignment tasks.

**Note: If the column names are in mixed case enclose it in double quotes
   For Example "Landing_Outcome"**

### Task 1




##### Display the names of the unique launch sites  in the space mission

In [66]:
# SQL query to retrieve unique launch sites
query = "SELECT DISTINCT LAUNCH_SITE FROM SPACEX ORDER BY 1;"

# Execute the query
cursor.execute(query)

# Fetch the results
unique_launch_sites = cursor.fetchall()

# Creare un DataFrame Pandas da unique_launch_sites
unique_launch = pd.DataFrame(unique_launch_sites, columns=["launch_site"])
unique_launch

    launch_site
0   CCAFS LC-40
1  CCAFS SLC-40
2    KSC LC-39A
3   VAFB SLC-4E


### Task 2


#####  Display 5 records where launch sites begin with the string 'CCA'

In [65]:
# SQL query to retrieve records for the specified launch site
query = "SELECT * FROM SPACEX WHERE LAUNCH_SITE LIKE 'CCA%' LIMIT 5;"

# Execute the query
cursor.execute(query)

# Fetch the results
results = cursor.fetchall()

# Creare un DataFrame Pandas da results
CCA = pd.DataFrame(results, columns=["DATE", "time__utc_", "booster_version", "launch_site", "payload", "payload_mass__kg_", "orbit", "customer", "mission_outcome", "landing__outcome"])
CCA

,DATE,time__utc_,booster_version,launch_site,payload,payload_mass__kg_,orbit,customer,mission_outcome,landing__outcome
0,2010-04-06,18:45:00,F9 v1.0 B0003,CCAFS LC-40,Dragon Spacecraft Qualification Unit,0,LEO,SpaceX,Success,Failure (parachute)
1,2010-08-12,15:43:00,F9 v1.0 B0004,CCAFS LC-40,"Dragon demo flight C1, two CubeSats, barrel of...",0,LEO (ISS),NASA (COTS) NRO,Success,Failure (parachute)
2,2012-05-22,07:44:00,F9 v1.0 B0005,CCAFS LC-40,Dragon demo flight C2,525,LEO (ISS),NASA (COTS),Success,No attempt
3,2012-08-10,00:35:00,F9 v1.0 B0006,CCAFS LC-40,SpaceX CRS-1,500,LEO (ISS),NASA (CRS),Success,No attempt
4,2013-01-03,15:10:00,F9 v1.0 B0007,CCAFS LC-40,SpaceX CRS-2,677,LEO (ISS),NASA (CRS),Success,No attempt

### Task 3




##### Display the total payload mass carried by boosters launched by NASA (CRS)

In [63]:
# SQL query to retrieve unique launch sites
query = "SELECT SUM(PAYLOAD_MASS__KG_) AS total_payload FROM SPACEX WHERE PAYLOAD LIKE '%CRS%';"

# Execute the query
cursor.execute(query)

# Fetch the results
result = cursor.fetchone()

# Creare un DataFrame Pandas da result
tot_payload = pd.DataFrame({"total_payload": [result[0]]})
tot_payload

  total_payload
0        111268

### Task 4




##### Display average payload mass carried by booster version F9 v1.1

In [62]:
query = "SELECT AVG(PAYLOAD_MASS__KG_) AS avg_payload FROM SPACEX WHERE BOOSTER_VERSION = 'F9 v1.1';"

# Execute the query
cursor.execute(query)

# Fetch the results
result = cursor.fetchone()

# Creare un DataFrame Pandas da result
avg_payload = pd.DataFrame({"avg_payload": [int(result[0])]})
avg_payload

   avg_payload
0         2928

### Task 5

##### List the date when the first succesful landing outcome in ground pad was acheived.


_Hint:Use min function_

In [60]:
# SQL query to retrieve the date of the first successful ground pad landing
query = "SELECT MIN(DATE) AS FIRST_SUCCESS_GP FROM SPACEX WHERE Landing_Outcome = 'Success (ground pad)';"

# Execute the query
cursor.execute(query)

# Fetch the results
result = cursor.fetchone()

first_success = pd.DataFrame({"first_success_gp": [result[0]]})
first_success

  first_success_gp
0       2015-12-22

### Task 6

##### List the names of the boosters which have success in drone ship and have payload mass greater than 4000 but less than 6000

In [58]:
# SQL query to retrieve unique launch sites
query = "SELECT DISTINCT BOOSTER_VERSION FROM SPACEX WHERE PAYLOAD_MASS__KG_ BETWEEN 4000 AND 6000 AND Landing_Outcome = 'Success (drone ship)';"

# Execute the query
cursor.execute(query)

# Fetch the results
before_boosters = cursor.fetchall()

boosters = pd.DataFrame(unique_launch_sites, columns=["booster_version"])
boosters

  booster_version
0   F9 v1.1 B1012
1   F9 v1.1 B1015

### Task 7




##### List the total number of successful and failure mission outcomes

In [57]:
# SQL query to retrieve unique launch sites
query = "SELECT MISSION_OUTCOME, COUNT(*) AS QTY FROM SPACEX GROUP BY MISSION_OUTCOME ORDER BY MISSION_OUTCOME;"

# Execute the query
cursor.execute(query)

# Fetch the results
succes_and_fail = cursor.fetchall()

# Print the unique launch sites
missions = pd.DataFrame(succes_and_fail, columns=["mission_outcome", "qty"])
missions

                    mission_outcome  qty
0               Failure (in flight)    1
1                           Success   98
2                          Success     1
3  Success (payload status unclear)    1

### Task 8



##### List the   names of the booster_versions which have carried the maximum payload mass. Use a subquery

In [56]:
# SQL query to retrieve unique launch sites
query = "SELECT DISTINCT BOOSTER_VERSION FROM SPACEX WHERE PAYLOAD_MASS__KG_ = (SELECT MAX(PAYLOAD_MASS__KG_) FROM SPACEX) ORDER BY BOOSTER_VERSION;"

# Execute the query
cursor.execute(query)

# Fetch the results
fetch_curs = cursor.fetchall()

booster_versions = pd.DataFrame(fetch_curs, columns=["booster_version"])
booster_versions

   booster_version
0    F9 B5 B1048.4
1    F9 B5 B1048.5
2    F9 B5 B1049.4
3    F9 B5 B1049.5
4   F9 B5 B1049.7
5    F9 B5 B1051.3
6    F9 B5 B1051.4
7    F9 B5 B1051.6
8    F9 B5 B1056.4
9   F9 B5 B1058.3
10  F9 B5 B1060.2
11   F9 B5 B1060.3

### Task 9


##### List the records which will display the month names, failure landing_outcomes in drone ship ,booster versions, launch_site for the months in year 2015.

**Note: SQLLite does not support monthnames. So you need to use  substr(Date, 6,2) as month to get the months and substr(Date,0,5)='2015' for year.**

In [54]:
# SQL query to retrieve records for the specified conditions
query = "SELECT BOOSTER_VERSION, LAUNCH_SITE FROM SPACEX WHERE Landing_Outcome = 'Failure (drone ship)' AND YEAR(DATE) = 2015;"

# Execute the query
cursor.execute(query)

# Fetch the results
unique_launch_sites = cursor.fetchall()

# Creare un DataFrame Pandas da unique_launch_sites
unique_launch_sites = pd.DataFrame(unique_launch_sites, columns=["booster_version", "launch_site"])
unique_launch_sites

  booster_version  launch_site
0   F9 v1.1 B1012  CCAFS LC-40
1   F9 v1.1 B1015  CCAFS LC-40

### Task 10




##### Rank the count of landing outcomes (such as Failure (drone ship) or Success (ground pad)) between the date 2010-06-04 and 2017-03-20, in descending order.

In [53]:
# SQL query to retrieve unique launch sites
query = "SELECT Landing_Outcome, COUNT(*) AS QTY FROM SPACEX WHERE DATE BETWEEN '2010-06-04' AND '2017-03-20' GROUP BY Landing_Outcome ORDER BY QTY DESC;"

# Execute the query
cursor.execute(query)

# Fetch the results
unique_launch_sites = cursor.fetchall()

landing_outcomes = pd.DataFrame(unique_launch_sites, columns=["landing__outcome", "qty"])
landing_outcomes

         landing__outcome  qty
0              No attempt   10
1    Failure (drone ship)    5
2    Success (ground pad)    5
3    Success (drone ship)    5
4      Controlled (ocean)    3
5    Uncontrolled (ocean)    2
6     Failure (parachute)    1
7  Precluded (drone ship)    1

In [67]:
landing_outcomes.shape

(8, 2)

### Reference Links

* <a href ="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/Labs_Coursera_V5/labs/Lab%20-%20String%20Patterns%20-%20Sorting%20-%20Grouping/instructional-labs.md.html?origin=www.coursera.org">Hands-on Lab : String Patterns, Sorting and Grouping</a>  

*  <a  href="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/Labs_Coursera_V5/labs/Lab%20-%20Built-in%20functions%20/Hands-on_Lab__Built-in_Functions.md.html?origin=www.coursera.org">Hands-on Lab: Built-in functions</a>

*  <a  href="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/Labs_Coursera_V5/labs/Lab%20-%20Sub-queries%20and%20Nested%20SELECTs%20/instructional-labs.md.html?origin=www.coursera.org">Hands-on Lab : Sub-queries and Nested SELECT Statements</a>

*   <a href="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/Module%205/DB0201EN-Week3-1-3-SQLmagic.ipynb">Hands-on Tutorial: Accessing Databases with SQL magic</a>

*  <a href= "https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/Module%205/DB0201EN-Week3-1-4-Analyzing.ipynb">Hands-on Lab: Analyzing a real World Data Set</a>

## Author(s)

<h4> Lakshmi Holla </h4>

## Other Contributors

<h4> Rav Ahuja </h4>

## Change log
| Date | Version | Changed by | Change Description |
|------|--------|--------|---------|
| 2021-07-09 | 0.2 |Lakshmi Holla | Changes made in magic sql|
| 2021-05-20 | 0.1 |Lakshmi Holla | Created Initial Version |

## <h3 align="center"> © IBM Corporation 2021. All rights reserved. <h3/>